OpenDTEF-v2012/tutorials/mesh/foamyHexMesh/mixerVessel/Allrun-simulation
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

cp system/controlDict.flow system/controlDict

rm -rf 0

runApplication createBaffles -overwrite
runApplication mergeOrSplitBaffles -split -overwrite

# Get rid of zero faced patches
runApplication createPatch -overwrite

# Copy fields after meshing to avoid the generation of unnecessary patch fields
restore0Dir

# Initialize alpha
runApplication setFields

# Decompose
runApplication -s main \
    decomposePar -force

# Run
runParallel $(getApplication)

# Reconstruct
runApplication reconstructPar -noFunctionObjects


#------------------------------------------------------------------------------
